## Queries
1. What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

2. What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

3. What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

4. What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

5. What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

6. What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

After performing all of your queries and displaying the answers to each question, save your notebook, commit the change to your repository and submit the repository URL for this assignment.

Note: Even if you get stuck on a query, please submit your attempts to document your efforts!

![png](https://s3.amazonaws.com/General_V88/boomyeah/company_209/chapter_3569/handouts/chapter3569_5431_sakila-db-model.png)

In [1]:
import pymysql
pymysql.install_as_MySQLdb()
import pandas as pd

In [2]:
from sqlalchemy import create_engine

In [3]:
username = "root"
password = "root"
db_name = "sakila"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"

In [4]:
engine = create_engine(connection)

In [11]:
q = '''SHOW tables'''
pd.read_sql(q, engine)

              Tables_in_sakila
0                        actor
1                   actor_info
2                      address
3                     category
4                         city
5                      country
6                     customer
7                customer_list
8                         film
9                   film_actor
10               film_category
11                   film_list
12                   film_text
13                   inventory
14                    language
15  nicer_but_slower_film_list
16                     payment
17                      rental
18      sales_by_film_category
19              sales_by_store
20                       staff
21                  staff_list
22                       store

Query 1 | What query would you run to get all the customers inside city_id = 312? Your query should return the customers' first name, last name, email, address, and city.

In [15]:
SELECT * FROM customers, customers.first_name, customers.last_name
LIMIT city_id = 132

SyntaxError: invalid syntax (2392113926.py, line 1)

Query 2 | What query would you run to get all comedy films? Note that the genre is called the category in this schema. Your query should return film title, description, release year, rating, and special features.

In [17]:
SELECT category_id
    FROM comedy
    WHERE film_category

SyntaxError: invalid syntax (1828480340.py, line 1)

Query 3 | What query would you run to get all the films that Johnny Lollobrigida was in? Your query should return the actor's last name, film title, and release year.

In [18]:
SELECT "Johnny Lollobrigida", film_id, TOTAL
    from actor_id

SyntaxError: invalid syntax (3135747812.py, line 1)

Query 4 | What query would you run to get the first and last names of all the actors in the movie titled "Bingo Talented"?

In [ ]:
SELECT * actor_id.first_name, actor_id.last_name, film_id("Bingo Talented")

Query 5 | What query would you run to get the customer_id associated with all payments greater than twice the average payment amount? (HINT: use 2* in your query to get twice the amount). Your result should include the customer id and the amount.

In [19]:
SELECT customer_id, payments > 2* AVG

SyntaxError: invalid syntax (4133200705.py, line 1)

Query 6 | What query would you run to list the first and last names of the 5 customers who have the highest number(count) of payments? You can title the number of payments as num_payments.

In [20]:
SELECT num_payments, customer_id.first_name, customer_id.last_name
FROM payments AS num_payments
WHERE payments
LIMIT 5 DESC

SyntaxError: invalid syntax (2523221795.py, line 1)